import 'package:japanese_practise_n5/classes/verb_form.dart';

var constDictionaryForm = VerbForm(
    'Толь', '書く', 'ある', '持つ', '読む', '買う', '見る', '食べる', '（来）くる*1', 'する');
var constPoliteForm = VerbForm('Эелдэг', '書きます', 'あります', '持ちます', '読みます', '買います',
    '見ます', '食べます', 'きます', 'します');

var constConjunctiveForm = VerbForm(
  'Холбох Form',
  '書き',
  'あり',
  '持ち',
  '読み',
  '買い',
  '見',
  '食べ',
  'き',
  'し',
);
var constTefrom = VerbForm(
  '-Тэ',
  '書いて,書きまして',
  'あって,ありまして',
  '持って,持ちまして',
  '読んで,読みまして',
  '買って,買いまして',
  '見て,見まして',
  '食べて,食べまして',
  'きて,きまして',
  'して,しまして',
);
var constTaform = VerbForm(
  '-Та',
  '書いた,書きました',
  'あった,ありました',
  '持った,持ちました',
  '読んだ,読みました',
  '買った,買いました',
  '見た,見ました',
  '食べた,食べました',
  'きた,きました',
  'した,しました',
);
var constNegativeFrom = VerbForm(
  'Үгүйсгэх',
  '書かない,書きません',
  'ない,ないです,ありません',
  '持たない,持ちません',
  '読まない,読みません',
  '買わない,買いません',
  '見ない,見ません',
  '食べない,食べません',
  'こない,きません',
  'しない,しません',
);
var constPastnegative = VerbForm(
  'Өнгөрсөн үгүйсгэх',
  '書かなかった,書きませんでした',
  'なかった,なかったです,ありませんでした',
  '持たなかった,持ちませんでした',
  '読まなかった,読みませんでした',
  '買わなかった,買いませんでした',
  '見なかった,見ませんでした',
  '食べなかった,食べませんでした',
  'こなかった,きませんでした',
  'しなかった,しませんでした',
);

var constPassiveForm = VerbForm(
  'Идэвхигүй',
  '書かれる,書かれます',
  '–',
  '持たれる,持たれます',
  '読まれる,読まれます',
  '買われる,買われます',
  '見られる,見られます',
  '食べられる,食べられます',
  'こられる,こられます',
  'される,されます',
);
var constCausativeForm = VerbForm(
  'Causative',
  '書かせる,書かせます',
  '–',
  '持たせる,持たせます',
  '読ませる,読ませます',
  '買わせる,買わせます',
  '見させる,見させます',
  '食べさせる,食べさせます',
  'こさせる,こさせます',
  'させる,させます',
);
var constCausativepassive = VerbForm(
  'Causative-passive',
  '書かされる,書かされます',
  '–',
  '持たされる,持たされます',
  '読まされる,読まされます',
  '買わされる,買わされます',
  '見させられる,見させられます',
  '食べさせられる,食べさせられます',
  'こさせられる,こさせられます',
  'させられる,させられます',
);
var constCommandForm = VerbForm(
  'Захирах, Тушаах',
  '書け',
  'あれ',
  '持て',
  '読め',
  '買え',
  '見ろ',
  '食べろ',
  'こい',
  'しろ',
);
var constConditionals = VerbForm(
  'Болзолт',
  '書けば',
  'あれば',
  '持てば',
  '読めば',
  '買えば',
  '見れば',
  '食べれば',
  'くれば',
  'すれば',
);
var constPotentialForm = VerbForm(
  'Чадамж',
  '書ける,書けます',
  '–',
  '持てる,持てます',
  '読める,読めます',
  '買える,買えます',
  '見られる*2,見られます',
  '食べられる*2,食べられます',
  'こられる*2,こられます',
  'できる,できます',
);
var constVolitionalform = VerbForm(
  'Уриалах, Хамтрах',
  '書こう,書きましょう',
  'あろう,ありましょう',
  '持とう,持ちましょう',
  '読もう,読みましょう',
  '買おう,買いましょう',
  '見よう,見ましょう',
  '食べよう,食べましょう',
  'こよう,きましょう',
  'しよう,しましょう',
);
