import 'package:japanese_practise_n5/classes/word.dart';

var lstNumber = <Word>[
  Word('1', '一', 'いち', 'нэг'),
  Word('2', '二', 'に', 'хоёр'),
  Word('3', '三', 'さん', 'гурав'),
  Word('4', '四', 'よん,し', 'дөрөв'),
  Word('5', '五', 'ご', 'тав'),
  Word('6', '六', 'ろく', 'зургаа'),
  Word('7', '七', 'なな,しち', 'долоо'),
  Word('8', '八', 'はち', 'найм'),
  Word('9', '九', 'きゅう', 'ес'),
  Word('10', '十', 'じゅう', 'арав'),
  Word('100', '百', 'ひゃく', 'зуу'),
  Word('1,000', '千', 'せん', 'мянга'),
  Word('10,000', '万', 'まん', 'арван мянга'),
  Word('100,000', '十万', 'じゅうまん', 'зуун мянга'),
  Word('1,000,000', '百万', 'ひゃくまん', 'сая'),
  Word('10,000,000', '千万', 'せんまん', 'арван сая'),
  Word('100,000,000', '一億', 'いちおく', 'зуун сая'),
  Word('1,000,000,000', '十億', 'じゅうおく', 'тэр бум')
];
