import 'package:japanese_practise_n5/classes/word.dart';

var lstMonthDay = <Word>[
  Word('1', '一日', 'いちにち (ついたち/いっぴ)', '1-ны өдөр / 1 өдөр'),
  Word('2', '二日', 'ふつか', '2-ны өдөр / 2 өдөр'),
  Word('3', '三日', 'みっか', '3-ны өдөр / 3 өдөр'),
  Word('4', '四日', 'よっか', '4-ны өдөр / 4 өдөр'),
  Word('5', '五日', 'いつか', '5-ны өдөр / 5 өдөр'),
  Word('6', '六日', 'むいか', '6-ны өдөр / 6 өдөр'),
  Word('7', '七日', 'なのか', '7-ны өдөр / 7 өдөр'),
  Word('8', '八日', 'ようか', '8-ны өдөр / 8 өдөр'),
  Word('9', '九日', 'ここのか', '9-ны өдөр / 9өдөр'),
  Word('10', '十日', 'とおか', '10-ны өдөр / 10 өдөр'),
  Word('11', '十一日', 'じゅういちにち', '11-ны өдөр / 11 өдөр'),
  Word('12', '十二日', 'じゅうににち', '12-ны өдөр / 12 өдөр'),
  Word('13', '十三日', 'じゅうさんにち', '13-ны өдөр / 13 өдөр'),
  Word('14', '十四日', 'じゅうよっか/じゅうよんにち', '14-ны өдөр / 14 өдөр'),
  Word('15', '十五日', 'じゅうごにち', '15-ны өдөр / 15 өдөр'),
  Word('16', '十六日', 'じゅうろくにち', '16-ны өдөр / 16 өдөр'),
  Word('17', '十七日', 'じゅうしちにち/じゅうななにち', '17-ны өдөр / 17 өдөр'),
  Word('18', '十八日', 'じゅうはちにち', '18-ны өдөр / 18 өдөр'),
  Word('19', '十九日', 'じゅうくにち', '19-ны өдөр / 19 өдөр'),
  Word('20', '二十日', 'はつか (にじゅうにち)', '20-ны өдөр / 20 өдөр'),
  Word('49', '四十九日', 'よんじゅうくにち (しじゅうくにち)', '49 өдөр'),
  Word('100', '百日', 'ひゃくにち', '100 өдөр'),
  Word('1,000', '千日', 'せんにち', '1,000 өдөр')
];
